app/Http/Controllers/BulkCdrController.php

select * from `site_information` limit 1
select * from `projects` where `projects`.`deleted_at` is null
---
    public function index(Request $request)
    {
        // GET THE SLUG, ex. 'posts', 'pages', etc.

        return view('admin.pages.cdrs.cdr-dynamic',  [
            'siteInformation' => SiteInformation::first(),
            'projects' => Project::all(),
        ]);