app/Http/Controllers/CdrController.php

    public function index()
    {

        return view('admin.pages.cdrs.index', [
            'user' => User::where('id', auth()->user()->id)->first(),
            'siteInformation' => SiteInformation::first(),
            'cdrs' => Cdr::where('status', '=', 'pending')->orderBy('id', 'DESC')->get(),
---
select * from `site_information` limit 1
select * from `cdrs` where `status` = 'pending' and `cdrs`.`deleted_at` is null order by `id` desc

    public function create()
    {
        return view('admin.pages.cdrs.create', [
            'user' => User::where('id', auth()->user()->id)->first(),
            'siteInformation' => SiteInformation::first(),
        ]);
---
select * from `cdrs` where `cdrs`.`deleted_at` is null order by `id` desc
select * from `users` where `id` = 1 limit 1
select * from `site_information` limit 1

    public function edit($id)
    {

        $cdr = Cdr::findorfail($id);

        return view('admin.pages.cdrs.edit', [
            'user' => User::where('id', auth()->user()->id)->first(),
            'siteInformation' => SiteInformation::first(),
            'cdr' => $cdr
        ]);
---
select * from `cdrs` where `cdrs`.`id` = '3' and `cdrs`.`deleted_at` is null limit 1
select * from `users` where `id` = 1 limit 1
select * from `site_information` limit 1