app/Http/Controllers/DynamicPeopleController.php

select * from `site_information` limit 1
---
    public function index(){
        return view('admin.pages.people.people-dynamic', [
            'siteInformation' => SiteInformation::first()

        ]);