app/Http/Controllers/PeopleController.php

    public function index()
    {
        return view('admin.pages.people.index', [
            'user' => User::where('id', auth()->user()->id)->first(),
            'siteInformation' => SiteInformation::first(),
            'peoples' => People::orderBy('id', 'DESC')->get(),

        ]);
---
select * from `users` where `id` = 1 limit 1
select * from `site_information` limit 1
select * from `peoples` where `peoples`.`deleted_at` is null order by `id` desc

    public function create()
    {
        return view('admin.pages.people.create', [
            'user' => User::where('id', auth()->user()->id)->first(),
            'siteInformation' => SiteInformation::first(),
        ]);
---
select * from `users` where `id` = 1 limit 1
select * from `site_information` limit 1