app/Http/Controllers/ReleaseCdrController.php

    public function index(){
        return view('admin.pages.cdrs.release-cdr', [
            'user' => User::where('id', auth()->user()->id)->first(),
            'siteInformation' => SiteInformation::first(),
            'cdrs' => Cdr::where('status', '=', 'release')->orderBy('id', 'DESC')->get(),
---
select * from `site_information` limit 1
select * from `cdrs` where `status` = 'release' and `cdrs`.`deleted_at` is null order by `id` desc