app/Http/Controllers/WinCdrController.php

    public function index()
    {

        return view('admin.pages.cdrs.win-cdr', [
            'user' => User::where('id', auth()->user()->id)->first(),
            'siteInformation' => SiteInformation::first(),
            'cdrs' => Cdr::where('status', '=', 'win')->orderBy('id', 'DESC')->get(),
---
select * from `site_information` limit 1
select * from `cdrs` where `status` = 'win' and `cdrs`.`deleted_at` is null order by `id` desc