app/Http/Controllers/Admin/DashboardController.php

    public function index()
    {

        return view('admin.pages.dashbaord',[
            'user' => User::where('id', auth()->user()->id)->first(),
            'siteInformation' => SiteInformation::first(),
        ]);
---
select * from `users` where `id` = 1 limit 1
select * from `site_information` limit 1

    public function profile(User $user)
    {

        return view('admin.pages.profile', [
            'user' => $user,
            'siteInformation' => SiteInformation::first(),
        ]);
---
select * from `site_information` limit 1